### Terraform Plan

#### Format & Validate
- Format: `success`
- Validate: `success`

#### Plan Output
```
data.aws_s3_bucket.website: Reading...
data.aws_s3_bucket.website: Read complete after 1s [id=kiwsan.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.website_files["404.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "0d09ebee146d3b3319648ea8d05c5024"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "404.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/404.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "12642ad53d4b90cd12569c32e453a502"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "47184965cf22883851aad1bbe83073d4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/ChatWidget.astro_astro_type_script_index_0_lang.v8vwqk6P.js.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/index.44rEcYXs.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "0c90c9cfeaf57c1175ae32efad95a194"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/index.44rEcYXs.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/index.44rEcYXs.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/index.44rEcYXs.css.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d7bd5917aed79c520803dba8f81e8f1b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/index.44rEcYXs.css.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/index.44rEcYXs.css.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/index.sW-a5Ua6.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "7c3847e7cc89607cfacf6f14ad35e719"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/index.sW-a5Ua6.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/index.sW-a5Ua6.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/index.sW-a5Ua6.css.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e63293b076ccde77676bcd79540785af"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/index.sW-a5Ua6.css.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/index.sW-a5Ua6.css.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-cyrillic-ext-wght-normal.BOeWTOD4.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "251d36f2b5a66c6e79ad71625244d016"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-cyrillic-ext-wght-normal.BOeWTOD4.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-cyrillic-ext-wght-normal.BOeWTOD4.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-cyrillic-wght-normal.DqGufNeO.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "de93fdc85e3d9009340f44f401ce62cf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-cyrillic-wght-normal.DqGufNeO.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-cyrillic-wght-normal.DqGufNeO.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-greek-ext-wght-normal.DlzME5K_.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "318d4ba568ac4340f4112bd0fb4d9376"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-greek-ext-wght-normal.DlzME5K_.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-greek-ext-wght-normal.DlzME5K_.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-greek-wght-normal.CkhJZR-_.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "8c7f6aea5e86ceaf66b92da8be90e5f1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-greek-wght-normal.CkhJZR-_.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-greek-wght-normal.CkhJZR-_.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-latin-ext-wght-normal.DO1Apj_S.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "1ad231aac0a8a891b8374aa5526a5813"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-latin-ext-wght-normal.DO1Apj_S.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-latin-ext-wght-normal.DO1Apj_S.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-latin-wght-normal.Dx4kXJAl.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "260c81a4759baf163c025001c4f27872"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-latin-wght-normal.Dx4kXJAl.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-latin-wght-normal.Dx4kXJAl.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/inter-vietnamese-wght-normal.CBcvBZtf.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "9df17551da76cba6ee2d5d35fc762ed9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/inter-vietnamese-wght-normal.CBcvBZtf.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/inter-vietnamese-wght-normal.CBcvBZtf.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-latin-400-normal.BaWBrqFP.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "0767fc298d7fddc46da3de3163b6653d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-latin-400-normal.BaWBrqFP.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-latin-400-normal.BaWBrqFP.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-latin-400-normal.Dh_FJjOB.woff"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a02cbb82b70246b1a3491f22e826e889"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-latin-400-normal.Dh_FJjOB.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-latin-400-normal.Dh_FJjOB.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-latin-ext-400-normal.B-1H0YkH.woff"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5518f326a6259effcba8325018c45e62"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-latin-ext-400-normal.B-1H0YkH.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-latin-ext-400-normal.B-1H0YkH.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-latin-ext-400-normal.nBP59pVw.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "db26eb631fa12cebfdca21efa2bb8e6e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-latin-ext-400-normal.nBP59pVw.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-latin-ext-400-normal.nBP59pVw.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-thai-400-normal.BEOmKAI1.woff2"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d0d6e11abaf72ad62ef43d1f62db77bb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-thai-400-normal.BEOmKAI1.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-thai-400-normal.BEOmKAI1.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_astro/noto-sans-thai-thai-400-normal.Dxb_unuU.woff"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "34f769c35cc2b1437b0eec2894ccd687"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_astro/noto-sans-thai-thai-400-normal.Dxb_unuU.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_astro/noto-sans-thai-thai-400-normal.Dxb_unuU.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_deferred.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "4809b11cf4271e4dfa8302b515826ad1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_deferred.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_deferred.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["_deferred.css.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "158e39e9c542ab4dfbd0b0afbb91bd47"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_deferred.css.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/_deferred.css.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/Layout_Buf_0AGl.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "18e5c57923c1d60bf55c5f24f8fa766f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/Layout_Buf_0AGl.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/Layout_Buf_0AGl.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/_astro_assets_BdZwSP-6.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "26c7d1ed5161bf99ffd59283a4fb617e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/_astro_assets_BdZwSP-6.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/_astro_assets_BdZwSP-6.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/_astro_data-layer-content_B-QgdZ6B.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "91e82ef70abc6dd1bff3cb927fc1952d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/_astro_data-layer-content_B-QgdZ6B.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/_astro_data-layer-content_B-QgdZ6B.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/astro/server_Cu4tHnzN.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "4cd2a6a0b607daa58fdc2941981eb5b1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/astro/server_Cu4tHnzN.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/astro/server_Cu4tHnzN.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/index_DK23cFf4.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "26c7157f914f9ed99c8f83e932a87837"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/index_DK23cFf4.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/index_DK23cFf4.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["chunks/sharp_BjRbc3wY.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "32b8b69e6b2847376ac8eb9c3f07182a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "chunks/sharp_BjRbc3wY.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/chunks/sharp_BjRbc3wY.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["favicon-16.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "4a4022a3bb7fee0bfea03817602eec24"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-16.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/favicon-16.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["favicon-180.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "b857a27fe900d3f78e953e85e97c1bc8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-180.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/favicon-180.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["favicon-32.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "3d3267c81de31cb095ce2d27674f144b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-32.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/favicon-32.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["favicon.ico"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/x-icon"
      + etag                   = "ee16d0a2250287f1ed7dd94c234713e1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["favicon.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "6e913dcfcf03463a5cd12a583d726e02"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/favicon.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["hero-illustration.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "ce2eae5772b66dfef5630b442ce3524e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "hero-illustration.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/hero-illustration.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/cs-assistant-dark.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "9bf0bdab804f0b4da61b9f9b7cef0fdb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/cs-assistant-dark.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/cs-assistant-dark.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/cs-assistant-light.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "9bf0bdab804f0b4da61b9f9b7cef0fdb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/cs-assistant-light.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/cs-assistant-light.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/digitalocean-badge.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "7e8383c572187f12c2dc24acec618017"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/digitalocean-badge.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/digitalocean-badge.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/hostinger-black.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "991ecc0262ed93e58f387aae48128709"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/hostinger-black.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/hostinger-black.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/og-image.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "50403863cdbfd87fcd7553688e234b4d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/og-image.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/og-image.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/programming_in_C_23-01.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "2911b61d07342a6c133f9eb047e1ca6f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/programming_in_C_23-01.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/programming_in_C_23-01.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/shuttrsnap-dark.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "7b7fc8482011dcdfe26aa00fa6ae2afb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/shuttrsnap-dark.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/shuttrsnap-dark.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["images/shuttrsnap-light.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ce681577bcc56b8643dfa45c099aa00a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/shuttrsnap-light.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/images/shuttrsnap-light.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["index.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "a018df74515fdfd0bccc72fb36ef6e72"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["logo.svg"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "8d155e2b18fb11a4c16bdb5d00326264"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/logo.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["pages/404.astro.mjs.gz"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d91e2a6b719863c79711add13ccd88d3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "pages/404.astro.mjs.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/pages/404.astro.mjs.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["robots.txt"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain"
      + etag                   = "ba61133504336acf703c71a582c61895"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["site.webmanifest"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "ffc2ef46c815196caa0996982372f9c3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site.webmanifest"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/site.webmanifest"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["sitemap-0.xml"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "2d754ef102264aa4e83e196eab88a5f1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sitemap-0.xml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/sitemap-0.xml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["sitemap-index.xml"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "0844bea36d181328aaec9bd289baf34e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sitemap-index.xml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/sitemap-index.xml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.website_files["sitemap.xml"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "kiwsan.com"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "cd310fbd1c236b1a62ba8e2f5e7791dc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sitemap.xml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/sitemap.xml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = "kiwsan.com"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Pusher: @kiwsan, Action: `pull_request`*